const phrases = [
    "Привет! Как твои дела?",
    "Всё получится — ты на правильном пути!",
    "Код пишется не сразу — главное начать.",
    "Ты уже знаешь больше, чем вчера!",
    "Ошибки — это просто подсказки от браузера 😊",
    "DOM — твой друг, а не враг!",
    "Сегодня ты учишься, завтра — создаёшь!",
    "Маленький шаг — всё равно шаг вперёд.",
];

const par = document.querySelector('.content p');
const btn = document.querySelector('button');

let i = 0;

btn.addEventListener('click', () => {
    par.textContent = phrases[i];

    i++

    if (i >= phrases.length) {
        i = 0;
    }
})